In [1]:
import pandas as pd

In [2]:
ds = pd.Series([1,2,3,4])

In [3]:
ds

0    1
1    2
2    3
3    4
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
### variable print it.

In [20]:
lis = [10,20,30,40,50,60,70,80,90,100]

In [23]:
df = pd.Series(lis)

In [24]:
df

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

### Create a Pandas DataFrame that contains the following data:
### Then, print the DataFrame.

In [26]:
data = {"Name" : ['Alice','Bob','Claire'],
        "Age" : [25,26,27],
        "gender": ['Female','Male','Female']
       }

In [27]:
df = pd.DataFrame(data)

In [28]:
df

     Name  Age  gender
0   Alice   25  Female
1     Bob   26    Male
2  Claire   27  Female

#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

### "Data Frame":- Data Frame is a labled 2 dimentsinal array 
### "Seires": - Series is a one dimensional Array

In [29]:
ds = pd.Series([1,2,3,4])
ds

0    1
1    2
2    3
3    4
dtype: int64

In [30]:
data = {"Name" : ['Alice','Bob','Claire'],
        "Age" : [25,26,27],
        "gender": ['Female','Male','Female']
       }

In [31]:
data

{'Name': ['Alice', 'Bob', 'Claire'],
 'Age': [25, 26, 27],
 'gender': ['Female', 'Male', 'Female']}

In [37]:
df = pd.DataFrame(data)

In [38]:
df

     Name  Age  gender
0   Alice   25  Female
1     Bob   26    Male
2  Claire   27  Female

#### What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
    you give an example of when you might use one of these functions?

  Head and Tail. Once we read a dataset into a pandas data frame, we want to take a look at it to get an overview. ...
  Dtypes. ...
  Shape and Size. ...

In [39]:
### Which of the following is mutable in nature Series, DataFrame, Panel?

A Series is a one dimensional array like structure with homogeneous data. The values of the series are mutable means we can change any value in series, but the size of the series is immutable so we can not change the size of the series. A series can hold any type of data like integer, decimal, string, python objects, etc.

DataFrame is a two-dimensional array with heterogeneous data. A DataFrame size is mutable and data is also mutable so we can change the data and size of DataFrame at any time.

The panel is a three-dimensional data structure with heterogeneous data. It is very hard to represent the Panel in a graphical representation. But a Panel can be illustrated as a container of a DataFrame. In Panel Data and size are mutable.

In [44]:
##Q7. Create a DataFrame using multiple Series. Explain with an example.
courses = pd.Series(["Spark","PySpark","Hadoop"], name='courses')
fees = pd.Series([22000,25000,23000], name='fees')
discount  = pd.Series([1000,2300,1000],name='discount')

df=pd.concat([courses,fees,discount],axis=1)
print(df)

   courses   fees  discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000